
times = {
    '07:45:00': '1️⃣',
    '08:00:00': '1️⃣',  # как округление времени?
    '09:30:00': '2️⃣',
    '11:15:00': '3️⃣',
    '13:10:00': '4️⃣',
    '14:55:00': '5️⃣',
    '15:00:00': '5️⃣',  # как округление времени?
    '16:30:00': '6️⃣',  # как округление времени?
    '16:40:00': '6️⃣',
    '18:15:00': '7️⃣',  # как округление времени?
    '18:25:00': '7️⃣',
    '20:10:00': '8️⃣',
}

kinds = {
    'Лк': 'лк',
    'Пз': 'пз',
    'Лб': 'лб',
    'Зал': 'зал',
    'Конс': 'кс',
    'ІспКомб': 'ісп',
    'ІспТест': 'ісп',
    'Екз': 'екз',
}
